Giacomo-Spano/ESP8266Webduino/Shield.cpp
bool Shield::requestSettingsFromServer() {
	logger.print(tag, F("\n\t >>requestSettingsFromServer"));
	setEvent(F("request server setting.."));
	settingsNeedToBeUpdated = false;
	lastSettingRequest = millis();
	Command command;
	bool res = command.requestShieldSettings(getMACAddress(), rebootreason);
	if (res)
		settingsRequestInprogress = true;
	else
		settingsRequestInprogress = false;
	logger.print(tag, F("\n\t <<requestSettingsFromServer res="));
	logger.print(tag, Logger::boolToString(res));
	return res;
}

void Shield::readSensorFromFile() {
	logger.print(tag, F("\n\t >>readSensorFromFile"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/sensors.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/sensors.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());

				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));
					logger.printJson(json);
					loadSensors(json);
				}
				else {
					logger.print(tag, F("\n\t failed to load sensors file"));
				}
			}
		}
	}
	else {
		logger.print(tag, F("\n\t failed to mount FS"));
	}
	logger.print(tag, F("\n\t <<readSensorFromFile"));
}

bool Shield::writeSensorToFile(JsonObject& json) {
	File configFile = SPIFFS.open("/sensors.json", "w");
	if (!configFile) {
		logger.print(tag, F("\n\t failed to open config file for writing"));
	}
	logger.printJson(json);
	json.printTo(configFile);
	configFile.close();
}

// carica i settings
// può essere chiamat inn qualunque moneto: quanto riceve i setting dal server
// oppure quando all'inizio la scheda legge i setting dalla eprom
bool  Shield::loadSensors(JsonObject& json) {

	logger.print(tag, F("\n\t>>loadSensors"));

	if (json.containsKey("shieldid")) {
		int shieldid = json["shieldid"];
		logger.print(tag, F("\n\t shieldid="));
		logger.print(tag, shieldid);
		setShieldId(shieldid);
	}
	else {
		logger.print(tag, "\n\t error -ID MISSING");
		return false;
	}

	if (json.containsKey("name")) {
		String name = json["name"];
		logger.print(tag, F("\n\t name="));
		logger.print(tag, name);
		setShieldName(name);
	}

	if (json.containsKey("sensors")) {
		String str = json["sensors"];
		size_t size = str.length();
		DynamicJsonBuffer jsonBuffer;
		JsonArray& sensorjsonarray = jsonBuffer.parseArray(str);

		clearAllSensors(); // serve per inizializzare
		//String sensorstr = sensorjsonarray.getFirst();
		for (int i = 0; i < sensorjsonarray.size(); i++) {
#ifdef ESP8266
			ESP.wdtFeed();
#endif // ESP8266
			logger.print(tag, F("\n\n\t SENSOR: "));
			//logger.printJson(tag, sensorstr);
			sensorjsonarray[i].printTo(Serial);

			Sensor* sensor = SensorFactory::createSensor(sensorjsonarray[i]);
			if (sensor != nullptr) {
				logger.print(tag, F("\n\n\t sensor="));
				logger.print(tag, sensor->toString());
				//sensorList.add(sensor);
				sensors.add(sensor);
				logger.print(tag, F("\n\n\t sensor num="));
				logger.print(tag, sensors.size());
			}
		}
	}
	else {
		logger.print(tag, F("\n\t No sensor found!"));
	}
	//logger.printFreeMem(tag, " end loadsensor");
	logger.print(tag, F("\n\t<<loadSensors\n"));
	return true;
}

#ifdef dopo
void Shield::addSensor(Sensor* pSensor) { // non è usata?????????

	logger.print(tag, F("\n\t >>addSensor "));
	logger.print(tag, pSensor->sensorname);
	sensorList.add((Sensor*)pSensor);
	//sensorList.show();
	logger.print(tag, F("\n\t <<addSensor"));
}
#endif

void Shield::writeRebootReason() {

	logger.println(tag, " >>writeRebootReason config");
	DynamicJsonBuffer jsonBuffer;
	JsonObject& json = jsonBuffer.createObject();
	json["rebootreason"] = getRebootReason();

	File configFile = SPIFFS.open("/reason.json", "w");
	if (!configFile) {
		logger.print(tag, "\n\t failed to open rebootreason file for writing");
		return;
	}

	json.printTo(Serial);
	json.printTo(configFile);
	configFile.close();
	logger.print(tag, "\n\t reason file written");
	logger.println(tag, "writeRebootReason config");
	//end save
}

void Shield::readRebootReason() {

	logger.println(tag, F(">>readRebootReason"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/config.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/reason.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());
				json.printTo(Serial);
				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));

					if (json.containsKey("rebootreason")) {
						Serial.println("rebootreason: ");
						String str = json["rebootreason"];
						logger.print(tag, str);
						String reason = json["rebootreason"];
						setRebootReason(str);
					}
				}
				else {
					logger.print(tag, F("\n\t failed to load json config"));
					//clean FS, for testing
					SPIFFS.format();
					writeConfig();
				}
			}
		}
	}
	else {
		logger.print(tag, F("failed to mount FS"));
	}
	logger.print(tag, F("<<readRebootReason"));
}

